In [1]:
import pandas as pd

In [2]:
file_path = '../datasets/input-file-10000.txt'

In [3]:
columns = ['Timestamp', 'FromHost', 'ToHost', ]

In [6]:
df = pd.read_csv(file_path, sep=' ', header=None, names=columns)

In [8]:
df

          Timestamp  FromHost    ToHost
0     1565647204351    Aadvik    Matina
1     1565647205599     Keimy    Dmetri
2     1565647212986  Tyreonna    Rehgan
3     1565647228897     Heera      Eron
4     1565647246869  Jeremyah  Morrigan
...             ...       ...       ...
9995  1565733587895    Jeiden   Shealee
9996  1565733589054   Trestyn    Sidney
9997  1565733592699    Sianah     Olvin
9998  1565733597482   Avionne    Zafina
9999  1565733598341     Sujey      Zyla

[10000 rows x 3 columns]

In [11]:
df["Datetime"] = pd.to_datetime(df["Timestamp"], unit='ms')

In [12]:
df

          Timestamp  FromHost    ToHost                Datetime
0     1565647204351    Aadvik    Matina 2019-08-12 22:00:04.351
1     1565647205599     Keimy    Dmetri 2019-08-12 22:00:05.599
2     1565647212986  Tyreonna    Rehgan 2019-08-12 22:00:12.986
3     1565647228897     Heera      Eron 2019-08-12 22:00:28.897
4     1565647246869  Jeremyah  Morrigan 2019-08-12 22:00:46.869
...             ...       ...       ...                     ...
9995  1565733587895    Jeiden   Shealee 2019-08-13 21:59:47.895
9996  1565733589054   Trestyn    Sidney 2019-08-13 21:59:49.054
9997  1565733592699    Sianah     Olvin 2019-08-13 21:59:52.699
9998  1565733597482   Avionne    Zafina 2019-08-13 21:59:57.482
9999  1565733598341     Sujey      Zyla 2019-08-13 21:59:58.341

[10000 rows x 4 columns]

In [13]:
df["Datetime"].min()

Timestamp('2019-08-12 22:00:04.351000')

In [14]:
df["Datetime"].max()

Timestamp('2019-08-13 21:59:58.341000')

In [19]:
df["ToHost"].value_counts(dropna=False)

ToHost
Lynnsie      24
Tilda        20
Jameice      20
Zhanasia     20
Jaelianna    19
             ..
Kaylum        3
Jaevaughn     3
Jerikka       3
Anissa        2
Sharon        2
Name: count, Length: 1000, dtype: int64

In [21]:
df.groupby(["ToHost","FromHost"]).count()

                  Timestamp  Datetime
ToHost  FromHost
Aadison Delona            1         1
        Dominiq           1         1
        Dristen           1         1
        Eddison           1         1
        Evelyse           1         1
...                     ...       ...
Zyriel  Eean              1         1
        Eldrin            1         1
        Ivanah            1         1
        Khamoni           1         1
        Ricquan           1         1

[9995 rows x 2 columns]